{"meta":{"title":"信平的小屋","subtitle":"不忘初心，方得始终 QQ=759949947","description":null,"author":"王信平","url":"http://yoursite.com"},"pages":[],"posts":[{"title":"用hexo搭建自己的博客","slug":"用hexo搭建自己的博客","date":"2017-04-01T14:14:46.000Z","updated":"2017-04-01T15:44:42.595Z","comments":true,"path":"2017/04/01/用hexo搭建自己的博客/","link":"","permalink":"http://yoursite.com/2017/04/01/用hexo搭建自己的博客/","excerpt":"Hexo是一个快速、简洁且高效的博客框架，支持markDown，有丰富的插件和主题。官方地址是： https://hexo.io/zh-cn/","text":"Hexo是一个快速、简洁且高效的博客框架，支持markDown，有丰富的插件和主题。官方地址是： https://hexo.io/zh-cn/ 安装环境安装git去git的官网下载安装软件，按照提示一步步使用默认安装就可以了，非常简单。 https://git-scm.com/ 安装Node.js去Node.js的官网，按照操作系统的选择不同的安装版本，按照提示一步步安装即可。 http://nodejs.org/ 安装Hexo鼠标右键选择Git Bash Here,然后在git命令行工具里输入以下命令： npm install -g hexo-cli 如果没有错误提示，那么在git的交互环境输入以下命令查看git版本： hexo version 到此，hexo就安装成功了，第一步结束，环境配置完毕可以开始创建自己的博客了 本地部署Hexostep1: 新建一个存放博客目录的文件夹，例如：blogstep2: 进入到blog文件夹 hexo init blog 然后 npm install,博客安装完毕step3: 使用以下命令启动博客 hexo s step4:打开浏览器 http://127.0.0.1:4000/ 即可访问 部署到Githubstep1: 在github上注册一个账号 https://github.com/ 在github上新建一个项目，博主的项目名字叫做cxinping.github.io,这个是固定的，不能改，一个github用户只能创建一个个人静态网页和一个组织静态网页。step2: 配置blog目录下的_config.yml文件，修改deploy参数，其中repository换成刚刚新建项目的git地址，这里用的https，也可以用git形式1234deploy: type: git repository: https://github.com/cxinping/cxinping.github.io.git branch: master step3: 在blog目录下，用上面提到的gitbash执行以下命令即可 hexo g hexo d step4:在浏览器中输入 https://cxinping.github.io 即可看到部署的博客。","categories":[],"tags":[{"name":"hexo","slug":"hexo","permalink":"http://yoursite.com/tags/hexo/"}]},{"title":"《NumPy 学习指南》笔记","slug":"《NumPy-学习指南》信平笔记","date":"2017-04-01T12:12:40.000Z","updated":"2017-04-01T13:50:18.410Z","comments":true,"path":"2017/04/01/《NumPy-学习指南》信平笔记/","link":"","permalink":"http://yoursite.com/2017/04/01/《NumPy-学习指南》信平笔记/","excerpt":"欢迎来到信平的小屋，QQ :759949947, Email: xpws2006@163.com此文是博主业余时间学习《NumPy 学习指南》做的笔记,但求吃透每个知识点，特此勉励自己。","text":"欢迎来到信平的小屋，QQ :759949947, Email: xpws2006@163.com此文是博主业余时间学习《NumPy 学习指南》做的笔记,但求吃透每个知识点，特此勉励自己。 第1章 NumPy 快速入门数组对象1234567891011121314151617181920212223242526272829303132333435363738# -*- coding: utf-8 -*-import sysfrom datetime import datetimeimport numpy as npdef numpysum(n): a = np.arange(n) ** 2 b = np.arange(n) ** 3 c = a + b return cdef pythonsum(n): a = range(n) b = range(n) c = [] for i in range(len(a)): a[i] = i ** 2 b[i] = i ** 3 c.append(a[i] + b[i]) return csize = 3 start = datetime.now()c = pythonsum(size)delta = datetime.now() - startprint \"The last 2 elements of the sum\", c[-2:]print \"PythonSum elapsed time in microseconds\", delta.microsecondsstart = datetime.now()c = numpysum(size)delta = datetime.now() - startprint \"The last 2 elements of the sum\", c[-2:]print \"NumPySum elapsed time in microseconds\", delta.microseconds","categories":[],"tags":[{"name":"《NumPy 学习指南》笔记","slug":"《NumPy-学习指南》笔记","permalink":"http://yoursite.com/tags/《NumPy-学习指南》笔记/"}]},{"title":"","slug":"刘克亚励志英语","date":"2017-03-31T10:12:40.000Z","updated":"2017-04-01T13:51:08.181Z","comments":true,"path":"2017/03/31/刘克亚励志英语/","link":"","permalink":"http://yoursite.com/2017/03/31/刘克亚励志英语/","excerpt":"刘克亚励志英语欢迎来到信平的小屋，QQ :759949947, Email: xpws2006@163.com本文是学习英语的磨耳朵材料，力求听透每个音节，学的向刘老师一样好，特此勉励自己。","text":"刘克亚励志英语欢迎来到信平的小屋，QQ :759949947, Email: xpws2006@163.com本文是学习英语的磨耳朵材料，力求听透每个音节，学的向刘老师一样好，特此勉励自己。 清晨励志演讲完整版Your browser does not support the audio element. As you slowly open your eyes, look around, notice where the light comes into your room, listen carefully, see if there are any new sounds you can recognize; feel with your body and spirit, see if you can sense the freshness in the air. Yes, yes, yes, it’s a new day, it’s a different day, and it’s a bright day! And most importantly, it is a new beginning for your life, a beginning where you are going to make new decisions, take new actions, make new friends and take your life to a totally unprecedented level. In your mind’s eye, you can see clearly the things you want to h*e, the places you intend to go, the relationships you desire to develop, and the positions you aspire to reach. You can hear your laughers of joy and happiness on the day when everything happens as you dream! You can see the smiles on the people around you when the magic moment strikes. You can feel your face is getting red, your heart is beating fast, and your blood is rushing all over your body, to every single corner of your being! You know all this is real as long as you are confident, passionate, and committed. And you are confident, you are passionate, you are committed! You will no longer fear making new sounds, showing new facial expressions, using your body in new ways, approaching new people, and asking new questions. You will live every single day of your life with absolute passion, and you will show your passion through the words you speak and the actions you take. You will focus all your time and effort on the most important goals of your life. You will never succumb to challenges and hardships; you will never w*er in you·r pursuit of excellence. After all, you are the best, and you deserve the best! As your coach and friend, I can assure you the door to all the best things in the world will open to you,but the key to that door is in your hand. You must do your part, you must faithfully follow the plans you make and take the actions you plan,you must never quit, you must never fear! I know you must do it, you can do it, you will do it,and you will succeed!Now stand firm and tall, make a fist, get excited and yell it out。I must do it! I can do it! I will do it! I will succeed! 中文： 当你慢慢睁开你的双眼，环顾四周，注意到阳光进入你的房间。请仔细聆听，看看有没有你能够识别的声音;用你的身体和灵魂去感受，看看你能否感触到空气的清新。 是的，是的，是的，这是全新的一天，这是与众不同的一天，这是阳光明媚的一天!最重要的是，这是你生命的新的开端：你将作出新的决定，采取新的行动，结交新的朋友，把你的生命带到一个完全史无前例的水平。 用你心灵的窗户，你能够清晰地看到：你想要拥有的东西，你打算去的地方，你渴望发展的关系，以及你希冀达到的地位。你可以听见在你梦想成真的那一天你快乐和幸福的笑声!你能够看见在这神奇的时刻到来时你周围的人们脸上的微笑。你会感觉到你的双颊正变得通红，心跳在加速，血液正流遍你的全身，涌向身体的每一个角落! 你知道，只要你信心十足，充满激情，并且勇于拼搏，一切将会变成现实。你是信心十足的，你是充满激情的，你是勇于献身的!你将不再害怕发出新的声音，表现新的面部表情，展示新的身姿，接近新的人们，以及询问新的问题。你将以绝对的激情去过好生活中的每一天;你将通过你的言行来展示你的激情。你将全神贯注于你生命中最重要的目标。你将永远也不会向挑战和磨难屈服;你将永远也不会在追求卓越时畏缩。毕竟，你是最优秀的，并且受之无愧。 作为你的教练和朋友，我可以向你保证：通往世界上最美好事物的大门将会向你敞开，但是这扇门的钥匙掌握在你的手中。你必须做你分内之事，你必须忠实地遵循你的计划，并且按计划行动。你必须永不言弃，必须无所谓惧!我知道你必须去做，你能够去做，你将会去做，你一定会成功!现在站稳了，立直了，握紧拳头，兴奋起来，并且大声呐喊：我必须去做，我能够去做，我将会去做，我一定会成功! 晚间励志演讲完整版Your browser does not support the audio element. As you lie down in your bed, close your eyes and relax. Take a deep breath and hold it for a count of 3 (1,2,3), then slowly exhale. Your body is in a comfortable position and your eyes are closed. Take another deep breath, even deeper than before, and hold the air for a count of 5 (1,2,3,4,5). Again, slowly let your breath out. Notice how relaxed and loose your body feels. Now inhale again, from the center of your body, and hold your breath for a count of 8 (1,2,3,4,5,6,7,8). Picture yourself standing in an observation elevator. Through the glasses, you can see the doors to all the buildings and the children playing on the ground between the buildings and the elevator. Slowly you begin to sense the elevator is moving, it’s going up. As it goes up, you begin to notice the windows and the people behind the windows. The buildings are tall, and it takes a little while to get to the top. Just as the elevator reaches over the buildings, a beautiful lake emerges in your sight, the water is clear and peaceful, ducks are playing on the lake and ripples are spreading. Beyond the lake is a grass covered mountain slope with sheep easily enjoying their meals. The elevator keeps going up, when it reaches over the top of the mountain, a beautiful harbor appears on the horizon. In the harbor sailboats are easily cruising on the blue and peaceful water. Around the harbor, large areas of trees and flowers and magnificent houses spread themselves regularly along the coast. You are struck by the beauty of the environment and the harmony between nature and design. You begin to imagine yourself living in that harbor, having all the things you ever desire, enjoying all the friendships you ever dream, and achieving all the accomplishments you ever aspire. You know all these beautiful things will be yours to keep, to cherish and to enjoy, because you have found a clear purpose for your life, you have developed a sound strategy, and you have taken all the actions necessary: You got up as promised everyday; you listened to the recordings and practiced as planned; you thought often and critically; you always wrote down your thoughts and inspirations; you pushed yourself beyond your comfort zone when it comes to making new friends and seizing every learning opportunity. Now, with 100% certainty you are moving in the right direction and at the right pace, you can be at ease going into sleep. Let your eyes relax, then your head, your neck, your shoulder, your chest, your waist, your thighs, your knees, your feet, your toes and your whole body. Go, slowly, go, sleep! Have a sweet dream! 中文： 当你躺在床上，闭上眼睛，放松。深吸一口气等我数到3 ,1，2，3〕，，然后慢慢呼出。你的身体很舒服，你的双眼闭着。再深呼一口气，比以前一口更深，屏住呼吸等我数到5〔1，2，3，4，5 〕，然后慢慢呼出。注意你很放松，你的身体软软的。再深吸一口气，感觉从你身体的重心处，屏住呼吸等我数到8 〔1，2，3，4，5 〕,然后慢慢的呼出。 想象自己站在一个观光电梯里，透过玻璃，你可以看到附近建筑物的门以及在空地上玩耍的孩子。慢慢地你意识到电梯在向上移动。随着电梯渐渐上行，你开始注意到建筑物的窗子背后的人。建筑物很高，过了好大一会，电梯渐渐靠近顶点。就当电梯超过建筑物的一瞬间，一潭漂亮的湖水出现在你的视野里。湖水清澈而平静，湖面上有鸭子在嬉戏，涟漪从它们身边慢慢地向外散去。湖水的外面是一个山坡，山坡上郁郁葱葱，山羊在上面懒懒地一边吃草一边玩耍。电梯继续上升，就在掠过山顶的一瞬间，一座漂亮的海港赫然出现在地平线上。海港中，帆船在湛蓝的海面上漫不经心地飘来飘去。海港周围，大片的鲜花和绿地以及设计精美的房屋沿海岸线规则有序地排列着。你被这优美的环境以及人与自然之间如此完美的融合深深地打动了，你开始想象自己就住在这个海港里，拥有你一切想得到的财物，享受你所梦想中的友谊，实现你所渴望中的成就。 你知道所有这一切都将会是你的，你可以尽情的享受和珍存。因为你现在有了明确的人生方向，制定出了完善的人生策略，采取一切必要的行动：你每天按计划起床；按计划听录音进行模仿；你经常思考问题，并随时将你的体会和灵感记录下来；你总是不断地激发自己、超越自己，让自己结交新的朋友，抓住每一个学习的机会。 现在，你可以完全肯定自己正在沿着正确的步调前进，你可以放心的进入梦乡了。尽量放松你的眼部，渐渐地，你的头部，你的颈部，你的肩部，你的胸部，你的腰部，你的大腿，你的膝关节，你的双脚，你的脚趾，你的全身……慢慢地，慢慢地，慢慢地，睡吧！做一个美梦！","categories":[],"tags":[{"name":"《刘克亚励志英语》","slug":"《刘克亚励志英语》","permalink":"http://yoursite.com/tags/《刘克亚励志英语》/"}]},{"title":"Hello World","slug":"hello-world","date":"2017-03-30T07:14:08.463Z","updated":"2017-03-30T07:18:33.480Z","comments":true,"path":"2017/03/30/hello-world/","link":"","permalink":"http://yoursite.com/2017/03/30/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}]}